*** crates/tianheng/src/runner.rs:558:21: replace match guard text.is_empty() with true in write_baseline

*** mutation diff:
--- crates/tianheng/src/runner.rs
+++ replace match guard text.is_empty() with true in write_baseline
@@ -550,17 +550,17 @@
         // truncated `{"format":`, or any other partial content might have held annotations before it
         // was damaged, so those stay refused.
         //
         // `create_new` is false: the file exists, so this takes the overwrite path, which preserves
         // its mode and swaps atomically. Gate mode (`--baseline`) deliberately does NOT share this
         // tolerance — see `gate`, where an unreadable baseline stays exit 2. Recording may safely
         // regenerate what it owns; gating consumes a declaration the adopter wrote, and a corrupt
         // one must be reported rather than read as "nothing is baselined".
-        Ok(text) if text.is_empty() => {
+        Ok(text) if true /* ~ changed by cargo-mutants ~ */ => {
             eprintln!(
                 "Tianheng: baseline {path} was empty, so there were no owner/tracker annotations to \
                  preserve (an interrupted write leaves exactly this); recording a fresh snapshot."
             );
             (Baseline::of(report), false)
         }
         Ok(text) => match Baseline::from_json(&text) {
             Ok(existing) => (Baseline::of_preserving(report, &existing), false),

---- runner::tests::write_baseline_refuses_every_unsupported_existing_document_without_modifying_it stdout ----
Tianheng: baseline /tmp/tianheng-baseline-v1-upgrade-2754624 was empty, so there were no owner/tracker annotations to preserve (an interrupted write leaves exactly this); recording a fresh snapshot.
Tianheng: wrote 1 violation(s) to baseline /tmp/tianheng-baseline-v1-upgrade-2754624

thread 'runner::tests::write_baseline_refuses_every_unsupported_existing_document_without_modifying_it' (2754778) panicked at crates/tianheng/src/runner/tests.rs:2115:9:
assertion `left == right` failed
  left: 0
 right: 2

---- runner::tests::write_baseline_preserves_hand_added_metadata_across_regeneration stdout ----
Tianheng: wrote 1 violation(s) to baseline /tmp/tianheng-baseline-merge-2754624
Tianheng: baseline /tmp/tianheng-baseline-merge-2754624 was empty, so there were no owner/tracker annotations to preserve (an interrupted write leaves exactly this); recording a fresh snapshot.
Tianheng: wrote 1 violation(s) to baseline /tmp/tianheng-baseline-merge-2754624

thread 'runner::tests::write_baseline_preserves_hand_added_metadata_across_regeneration' (2754777) panicked at crates/tianheng/src/runner/tests.rs:2097:5:
assertion `left == right` failed
  left: Null
 right: "team-core"

failures:
    runner::tests::write_baseline_preserves_hand_added_metadata_across_regeneration
    runner::tests::write_baseline_refuses_every_unsupported_existing_document_without_modifying_it

test result: FAILED. 85 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
