*** crates/tianheng/src/runner.rs:558:21: replace match guard text.is_empty() with false in write_baseline

*** mutation diff:
--- crates/tianheng/src/runner.rs
+++ replace match guard text.is_empty() with false in write_baseline
@@ -550,17 +550,17 @@
         // truncated `{"format":`, or any other partial content might have held annotations before it
         // was damaged, so those stay refused.
         //
         // `create_new` is false: the file exists, so this takes the overwrite path, which preserves
         // its mode and swaps atomically. Gate mode (`--baseline`) deliberately does NOT share this
         // tolerance — see `gate`, where an unreadable baseline stays exit 2. Recording may safely
         // regenerate what it owns; gating consumes a declaration the adopter wrote, and a corrupt
         // one must be reported rather than read as "nothing is baselined".
-        Ok(text) if text.is_empty() => {
+        Ok(text) if false /* ~ changed by cargo-mutants ~ */ => {
             eprintln!(
                 "Tianheng: baseline {path} was empty, so there were no owner/tracker annotations to \
                  preserve (an interrupted write leaves exactly this); recording a fresh snapshot."
             );
             (Baseline::of(report), false)
         }
         Ok(text) => match Baseline::from_json(&text) {
             Ok(existing) => (Baseline::of_preserving(report, &existing), false),

---- a_zero_length_baseline_is_recorded_afresh_but_partial_content_is_still_refused stdout ----

thread 'a_zero_length_baseline_is_recorded_afresh_but_partial_content_is_still_refused' (2756522) panicked at crates/tianheng/tests/baseline_cli.rs:176:5:
  left: Some(2)
 right: Some(0)

failures:
    a_zero_length_baseline_is_recorded_afresh_but_partial_content_is_still_refused

test result: FAILED. 17 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
