*** crates/tianheng/src/runner.rs:657:5: replace sync_parent_dir with ()

*** mutation diff:
--- crates/tianheng/src/runner.rs
+++ replace sync_parent_dir with ()
@@ -649,28 +649,17 @@
 /// this platform not offering the operation, not as the write having failed.
 ///
 /// Unix only for the compile-time half: `File::open` on a directory is not portable — Windows
 /// requires `FILE_FLAG_BACKUP_SEMANTICS`, which `std` does not expose through `OpenOptions`. The
 /// `File` import is scoped to the block for that reason, so it is not an unused import off unix.
 /// A path with no parent component (a bare relative filename) resolves to the working directory,
 /// which is where such a write actually lands.
 fn sync_parent_dir(path: &Path) {
-    #[cfg(unix)]
-    {
-        use std::fs::File;
-
-        let parent = path
-            .parent()
-            .filter(|parent| !parent.as_os_str().is_empty())
-            .unwrap_or_else(|| Path::new("."));
-        let _ = File::open(parent).and_then(|dir| dir.sync_all());
-    }
-    #[cfg(not(unix))]
-    let _ = path;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// `create_new`'s `O_EXCL` fails on any existing directory entry, including a dangling symlink —
 /// a baseline path whose symlink target does not exist reads as `NotFound` one line up (so this,
 /// the create-new path, runs), then hits `AlreadyExists` here, indistinguishable from a genuine
 /// concurrent creation without checking `symlink_metadata` explicitly. That distinction matters:
 /// a dangling symlink is a permanent state, not a race — "rerun the command" (the concurrent-
 /// creation arm's own remedy) would fail identically forever, so this earns its own diagnosis.

*** result: Success
