*** crates/tianheng/src/runner.rs:663:30: delete ! in sync_parent_dir

*** mutation diff:
--- crates/tianheng/src/runner.rs
+++ delete ! in sync_parent_dir
@@ -655,17 +655,17 @@
 /// which is where such a write actually lands.
 fn sync_parent_dir(path: &Path) {
     #[cfg(unix)]
     {
         use std::fs::File;
 
         let parent = path
             .parent()
-            .filter(|parent| !parent.as_os_str().is_empty())
+            .filter(|parent|  /* ~ changed by cargo-mutants ~ */parent.as_os_str().is_empty())
             .unwrap_or_else(|| Path::new("."));
         let _ = File::open(parent).and_then(|dir| dir.sync_all());
     }
     #[cfg(not(unix))]
     let _ = path;
 }
 
 /// `create_new`'s `O_EXCL` fails on any existing directory entry, including a dangling symlink —

*** result: Success
