*** crates/tianheng/src/runner.rs:488:5: replace require_non_empty -> Result<String, u8> with Ok("xyzzy".into())

*** mutation diff:
--- crates/tianheng/src/runner.rs
+++ replace require_non_empty -> Result<String, u8> with Ok("xyzzy".into())
@@ -480,22 +480,17 @@
 /// The one rule both flag forms share: a value must not be empty. `--flag=` and `--flag ""` are the
 /// same mistake as `--flag` with nothing after it — a flag given no value — so all three are one
 /// usage error (exit 2) rather than an empty string carried onward. An empty path reaches the
 /// filesystem as `""` and answers `NotFound`, which reads as "cannot read baseline " against a path
 /// nobody typed: the malformed invocation misreported as a missing file, the same misdirection the
 /// flag-shaped-value rule exists to prevent one shape earlier. Shared by the space and equals forms
 /// so the two cannot diverge on what counts as a value.
 fn require_non_empty(flag: &str, value: String) -> Result<String, u8> {
-    if value.is_empty() {
-        return Err(usage(&format!(
-            "{flag} requires a value, but was given an empty one"
-        )));
-    }
-    Ok(value)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Walk up from the current directory to the nearest `Cargo.toml`, cargo-style, so
 /// `check` can default its target like `cargo` does when `--manifest-path` is omitted.
 /// The shell reads the cwd; the walk itself is the pure [`nearest_manifest_from`].
 fn nearest_manifest() -> Option<PathBuf> {
     nearest_manifest_from(std::env::current_dir().ok()?)
 }

error: unknown --format 'xyzzy' (expected text, json, markdown, or sarif)

error: unknown --format 'xyzzy' (expected text, json, markdown, or sarif)

---- runner::tests::list_json_exits_0 stdout ----
usage:
  tianheng check --manifest-path <path/to/Cargo.toml> [--baseline <file> | --write-baseline <file>] [--format text|json|sarif] [--warn-uncovered] [--disallow-stale]
  tianheng list [--format text|json|markdown]
error: unknown --format 'xyzzy' (expected text, json, markdown, or sarif)

thread 'runner::tests::list_json_exits_0' (2768000) panicked at crates/tianheng/src/runner/tests.rs:1875:5:
assertion `left == right` failed
  left: 2
 right: 0

---- runner::tests::list_accepts_markdown_format stdout ----
usage:
  tianheng check --manifest-path <path/to/Cargo.toml> [--baseline <file> | --write-baseline <file>] [--format text|json|sarif] [--warn-uncovered] [--disallow-stale]
  tianheng list [--format text|json|markdown]
error: unknown --format 'xyzzy' (expected text, json, markdown, or sarif)

thread 'runner::tests::list_accepts_markdown_format' (2767998) panicked at crates/tianheng/src/runner/tests.rs:1679:5:
assertion `left == right` failed
  left: 2
 right: 0

---- runner::tests::sarif_exits_like_json stdout ----
usage:
  tianheng check --manifest-path <path/to/Cargo.toml> [--baseline <file> | --write-baseline <file>] [--format text|json|sarif] [--warn-uncovered] [--disallow-stale]
  tianheng list [--format text|json|markdown]
error: unknown --format 'xyzzy' (expected text, json, markdown, or sarif)

thread 'runner::tests::sarif_exits_like_json' (2768031) panicked at crates/tianheng/src/runner/tests.rs:1632:9:
assertion `left == right` failed: violating fixture exits 1 under --format json
  left: 2
 right: 1

failures:
    runner::tests::an_orphan_probe_reacts_with_no_declared_boundary
    runner::tests::list_accepts_markdown_format
    runner::tests::list_json_exits_0
    runner::tests::sarif_exits_like_json
    runner::tests::the_crate_source_rule_is_wired_through_dispatch
    runner::tests::the_runtime_dimension_is_wired_through_dispatch
    runner::tests::warn_uncovered_never_changes_the_exit_code

test result: FAILED. 80 passed; 7 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
